; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image1 - mode
	thermograph0 - mode
	infrared3 - mode
	image4 - mode
	spectrograph5 - mode
	thermograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(have_image Planet7 infrared3)
	(have_image Planet7 thermograph2)
	(have_image Star8 thermograph0)
	(have_image Star8 spectrograph5)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon11 thermograph2)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Star13 spectrograph5)
))

)

; plan
1. (turn_to satellite1 groundstation0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   goals met: 0 of 11
5. (take_image satellite1 planet7 instrument1 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 1 of 11
6. (take_image satellite1 planet7 instrument1 infrared3)
   added: (have_image planet7 infrared3)
   goals met: 2 of 11
7. (turn_to satellite1 phenomenon11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 11
8. (take_image satellite1 phenomenon11 instrument1 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 3 of 11
9. (take_image satellite1 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 11
10. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 11
11. (take_image satellite1 phenomenon10 instrument1 image1)
   added: (have_image phenomenon10 image1)
   goals met: 5 of 11
12. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 5 of 11
13. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 5 of 11
14. (turn_to satellite1 star4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star4)
   goals met: 5 of 11
15. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 5 of 11
16. (turn_to satellite1 phenomenon12 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon12)
   goals met: 5 of 11
17. (take_image satellite1 phenomenon12 instrument2 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 6 of 11
18. (turn_to satellite1 planet9 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet9)
   goals met: 6 of 11
19. (take_image satellite1 planet9 instrument2 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 7 of 11
20. (turn_to satellite1 star13 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star13)
   goals met: 7 of 11
21. (take_image satellite1 star13 instrument2 spectrograph5)
   added: (have_image star13 spectrograph5)
   goals met: 8 of 11
22. (take_image satellite1 star13 instrument2 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 9 of 11
23. (turn_to satellite1 star8 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star8)
   goals met: 9 of 11
24. (take_image satellite1 star8 instrument2 spectrograph5)
   added: (have_image star8 spectrograph5)
   goals met: 10 of 11
25. (take_image satellite1 star8 instrument2 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 11 of 11
